//////////新建
let arr = new Array() //[]
let arr2 = new Array(3) //[empty × 3]
let arr3 = new Array(1,2,3) //[1, 2, 3]
let arr4 = ['a','b',[1,2]]  //["a", "b", Array(2)]

//////////属性
//length  
//可读可写
[1,2,3].length //3
[1,2].length=5 //[1,2,,,]
[1,2,3,4,5].length=2 //[1,2]
let arr5 = [3,2,1]
arr5[6]=6 //[3, 2, 1, empty × 3, 6]
arr5[4] //undefined
let arr6 =[]
arr6.length //0


//////////方法

//////////////////////////////////////////操作
//////////插入/添加
////头部插入
let arr7 = [1,2,3]
arr7.unshift(0) //[0,1,2,3]
////任意位置插入
arr7.splice(1,0,'666') //[1, "666", 2, 3]
////尾部插入
arr7.push(4) //[0, 1, 2, 3, 4]

//////////删除
//头部删除
let arr8 = [3,4,5]
arr8.shift() //[4,5]
//任意位置删除
arr8.splice(1,1) //[3,5]
//尾部删除
arr8.pop() //[3,4]

/////////修改/替换
//头部修改
let arr9 = [6,7,8]
arr9[0]=1 //[1, 7, 8]
arr9.splice(0,1,'第一') //["第一", 7, 8]
//任意位置修改
arr9[1]=22 //[6, 22, 8]
arr9.splice(1,1,'任意') //[6, "任意", 8]
//尾部修改
arr9[arr9.length-1]=0 //[6, 7, 0]
arr9.splice(arr9.length-1,1,'最后') //[6, 7, "最后"]

//////////查询
//头部查询
//任意位置查询
//尾部查询

//////////合并

/////////截取/裁剪


//////////拷贝/复制


//////////排序
//数字大小排序
//时间排序
//本地排序
//多重排序


//////////类型转换


//////////////////////////////////////////操作





////////遍历/迭代
