//字符串长度
"string".length
//返回指定索引位置的字符
"abc".charAt(1) //"b"
"abcdef"[0] //a
var cc = "abcdef"
cc[cc.length-1] //f
//返回指定索引位置字符的Unicode编码
"abc诶比西".charCodeAt(1) //98
//Unicode编码转成字符
String.fromCharCode(97) //"a"
//连接字符串
"123".concat("456") //"123456"
"0".concat(123) //"123"
"abc"+"123" //"abc123"
//返回指定字符串第一次出现的位置,没有返回-1
"wtf".indexOf("w") //0  
"1.345,2.2".indexOf(".") //1
//最后一次出现的位置，没有返回-1
"wftwtf".lastIndexOf("w") //3
"wftwtf".lastIndexOf("wtf") //3

//找到一个或多个正则表达式的匹配，没有返回null
"old school".match('o') //返回对象[0 : "o" groups : undefined index : 0 input : "old school" length : 1]
"old school".match(/o/g) //返回数组 ["o", "o", "o"]
"123".match(/0/) //null
var yyu = "123".match(/0/)
Boolean(yyu) //false  //null
var yyu = "123".match(/1/)
Boolean(yyu) //true

//替换与正则表达式匹配的子串
"Hip Hop".replace(/Hop/,'Hop Is Power') //第一个 "Hip Hop Is Power"
"Hip Hop".replace(/p/g,'P') //全局 "HiP HoP"
"Hip Hop".replace(/p/g,'1') //没有找到 "Hip Hop"

//返回与正则表达式匹配的子串的起始位置，没有返回-1
"Popin".search(/i/) //3
"Popin&Locking".search(/in/g) //3
"Popin&Locking".search(/l/i) //6

//返回指定开始位置（包括开始位置，若为负数则从末尾处开始计算起始位置，即-1表示倒数第一个）
//到指定结束位置（不包括结束位置，若未指定此参数，则包括从指定的开始位置开始到字符串结尾的所有字符）的字符串
"She is Good Dancer".slice(0,3) //"She"
"She is Good Dancer".slice(-6,-1) //"Dance"

//substr(index,length)：提取从指定index（索引，必需，若为负数则从末尾处开始计算起始位置，即-1表示倒数第一个）
//开始的length（长度，可选，若未指定此参数，则包括从指定的index开始到字符串结尾的所有字符）个字符
"She is Good Dancer".substr(4,3) //"is "
"She is Good Dancer".substr(-6,6) //"Dancer"

//提取指定开始位置（包括开始位置）到结束位置（不包括结束位置，可选，若未指定此参数，
//则包括从指定的开始位置开始到字符串结尾的所有字符）的字符
//与 slice() 和 substr() 方法不同的是，substring() 不接受负的参数
"She is Good Dancer".substring(0,3) //"She"
"She is Good Dancer".substring(-1,7) //负数变成0 "She is "
"She is Good Dancer".substring(-19,7) //"She is "

//将字符串分割为子字符串数组（第二个参数可指定返回的数组的最大长度，可选）
"do not want to work".split(" ") //返回数组 ["do", "not", "want", "to", "work"]
"do not want to work".split(" ",3)  // ["do", "not", "want"]

//将字符串转换为小写
"Yo~ Bro Wath is up".toLowerCase() //"yo~ bro wath is up"
//转换为大写
"Yo~ Bro Wath is up".toUpperCase() //"YO~ BRO WATH IS UP"

//返回字符串
[1,2,3].toString() //"1,2,3"
"do not want to work".split(" ").toString() //"do,not,want,to,work"

//反转字符串
"whta the f*ck!".split("").reverse().join("") //"!kc*f eht athw"


//////////////////////////////////////////////////////////////////////////////////////////

//搜索字符返回结果数量并添加标记
//content字符串,value搜索词,gi修饰符,which需要的结果
var searchStr = function(content,value,gi,which){
  if(!gi) gi="g"
  let reg = new RegExp(value,gi)
  let jg = content.match(reg)
  if(!jg) return "没有符合的结果！"
  if(which=="num") return jg.length
  if(which=="con") return content.replace(reg,"#"+value+"#")
  else return "结果"+jg.length+"个\n"+content.replace(reg,"#"+value+"#")
}
var nn ="今天天气真好啊啊啊啊啊哦哦哦哦"
searchStr(nn,"天","g")
// "结果2个
// 今#天##天#气真好啊啊啊啊啊哦哦哦哦"
//学习：https://www.cnblogs.com/guoyeqiang/p/8178336.html

//////////////////////////////////////////////////////////////////////////////////////////
/*
思路：
01.判断两个string的长度，用短的去对比长的
02.将短string截取设置好的长度的词段去text()长的string
03.如果flash就继续搜索下个词段，如果true，将得分累加到结果
04.输出单次结果，得到（例：长度是2的词段的搜索结果）
05.继续长度是3、4、5、6、7...的词段的计算，取平均值
06.得出最后结果
*/
//对比两个字符串的相似性
var comparedStr = function(con1,con2,wordnum){
  //if(!con1 || !con2) return "缺少字符串-function(con1*,con2*,wordnum词的长度)"
  //if(con1.length<100 || con2.length<100) return "字符串长度小于100"
  if(!wordnum) wordnum=2
  let s = {
    con1:con1, //第一个字符串
    con2:con2, //第二个字符串
    regexp:new RegExp(),
    wordnum:wordnum, //词汇对比
    conlong:"",
    conshort:"",
    constay:"",
    conarray:[],
    jg_proportion:0,
    jg:0
  }
  //用短的去对比长的
  if(s.con1.length>=s.con2.length) {s.conlong=s.con1; s.conshort=s.con2}
  else {s.conlong=s.con2; s.conshort=s.con1}
  s.jg_proportion = s.wordnum / s.conshort.length //每段得分占比
  //把每词依次搜索
  for(let i=0;i<s.conshort.length;i+=s.wordnum){
    let confrag = s.conshort.substr(i,s.wordnum)
    s.regexp=new RegExp(confrag,"g");
    let result = s.regexp.test(s.conlong);
    if(result) s.jg+=s.jg_proportion
  }
  return s.jg*100
}
//多次搜索取平均值
var comparedStrOk = function(con1,con2,numoftime_sm,numoftime_big){
    if(!con1 || !con2) return "缺少字符串-function(con1*,con2*,numoftime_sm词的最小长度,numoftime_big词的最大长度)"
    if(con1.length<100 || con2.length<100) return "字符串长度不能小于100!!!"
    //设置默认值
    if(!numoftime_sm) numoftime_sm=2
    if(!numoftime_big) numoftime_big=8
    let jg=0;
    for(let i=numoftime_sm;i<numoftime_big;i++){
      jg+=comparedStr(con1,con2,i)
    }
    jg = Math.round(jg/(numoftime_big-numoftime_sm))
    return "相似度："+jg +"%"
}
//测试数据
var h1="特朗普被指陷困境无心理政 伊万卡忧父亲被弹劾(图) 米利班德2018/9/14 14:49:52061 导读：年月日::来源：海外网原标题：特朗普被曝陷困境无心理政伊万卡忧父亲被弹劾伊万卡（图源：视觉中国）海外网月日电近来，特朗普的日子不太好过。除了飓风“佛罗伦斯”登陆美国这样无法避免的天灾外，这位美国总统还因爆料政府众多内幕的新书，以及发表匿名文章的白宫“深喉”而感到愤怒异常，甚至被认为已经“无心理政”，其支持率也暴跌至%。有媒体曝出，就连特朗普的女儿伊万卡都已经开始担心，自己的父亲会遭到弹劾。据美国《名利场》网站报道，月日，美国知名记者伍德沃德的新书《恐惧：特朗普入主白宫》上市首日的销量就已超过万册 2018年09月14日 13:48:46 来源：海外网 原标题：特朗普被曝陷困境无心理政 伊万卡忧父亲被弹劾 伊万卡 海外网9月14日电 近来，特朗普的日子不太好过。除了飓风“佛罗伦斯”登陆美国这样无法避免的天灾外，这位美国总统还因爆料政府众多内幕的新书，以及发表匿名文章的白宫“深喉”而感到愤怒异常，甚至被认为已经“无心理政”，其支持率也暴跌至36%。有媒体曝出，就连特朗普的女儿伊万卡都已经开始担心，自己的父亲会遭到弹劾。 据美国《名利场》网站报道，9月13日，美国知名记者伍德沃德的新书《恐惧：特朗普入主白宫》上市首日的销量就已超过75万册，并正在第9次重印。书中揭露了特朗普政府众多内幕以及特朗普在日常生活和工作中的各种表现，引发不小争议，而站在风口浪尖的特朗普更是连连指责伍德沃德捏造了他和其他人的发言，指责他是个“骗子”，而他写的书就是个笑话。消息人士透露，特朗普还对自己的前经济顾问加里·科恩等人与这本书作者间的明显合作感到愤怒。 相比这本新书的爆料，特朗普更加愤怒的是有白宫高官在《纽约时报》上匿名撰写评论痛骂自己一事。《名利场》的记者谢尔曼进一步披露称，有消息人士表示，特朗普当前“饱受此事困扰”、“陷入困境”，并且因怀疑泄密者还在他的身边而“吓得不轻”，他的儿子小特朗普被曝曾告知身边人，他担心父亲会因此而无法入睡。 美国水星新闻网则称，特朗普最近关注的焦点已经不再是治理国家，而是对那些在新书上和伍德沃德进行合作的人发起攻击，并找出撰写匿名评论的“内鬼”究竟是谁。一位接近特朗普的白宫顾问称，特朗普正在指示助手们在公开场合称这位匿名者为“懦夫”，通过对其进行羞辱，以希望对方会在压力下打破沉默。 美国总统特朗普 文章还指出，特朗普认为，自己经历的事情意味着“有一场政变”。一位前官员透露，特朗普与国防部长马蒂斯本就关系紧张，而现在他们几乎已经毫无联系。而这位美国总统除了信任白宫高级政策顾问斯蒂芬·米勒外，唯一信任的就是家人——女儿伊万卡以及女婿库什纳了。这意味着他的女儿女婿已经承担起了包括包括找到白宫“内鬼”以及控制危机的各种责任。而鉴于白宫当前的“混乱状态”，一位接近这位“第一女儿”的消息人士也透露，就连伊万卡也在担心自己的父亲会被弹劾一事。 CNN在本周公布的一项民意调查显示，特朗普的支持率已经从8月份的42%降至36%，只有32%的受访者认为他是“诚实且值得信赖的”。同一天，昆尼皮亚克大学的一项民意调查称，特朗普的支持率为38%，相比前一个月的41%有所下降。这份调查还指出，55%的美国人认为特朗普不适合当总统，65%的人认为他并不是一个头脑冷静的人，还有42%的受访者认为他精神并不稳定。（海外网张霓） [责任编辑：张博麟 PS038"
var h2 ="特朗普被指陷困境无心理政 伊万卡忧父亲被弹劾 2018年09月14日 13:48:46 来源：海外网 2598人参与 312评论 原标题：特朗普被曝陷困境无心理政 伊万卡忧父亲被弹劾 VCG111161794964.jpg 伊万卡（图源：视觉中国） 海外网9月14日电 近来，特朗普的日子不太好过。除了飓风“佛罗伦斯”登陆美国这样无法避免的天灾外，这位美国总统还因爆料政府众多内幕的新书，以及发表匿名文章的白宫“深喉”而感到愤怒异常，甚至被认为已经“无心理政”，其支持率也暴跌至36%。有媒体曝出，就连特朗普的女儿伊万卡都已经开始担心，自己的父亲会遭到弹劾。 据美国《名利场》网站报道，9月13日，美国知名记者伍德沃德的新书《恐惧：特朗普入主白宫》上市首日的销量就已超过75万册，并正在第9次重印。书中揭露了特朗普政府众多内幕以及特朗普在日常生活和工作中的各种表现，引发不小争议，而站在风口浪尖的特朗普更是连连指责伍德沃德捏造了他和其他人的发言，指责他是个“骗子”，而他写的书就是个笑话。消息人士透露，特朗普还对自己的前经济顾问加里·科恩等人与这本书作者间的明显合作感到愤怒。 相比这本新书的爆料，特朗普更加愤怒的是有白宫高官在《纽约时报》上匿名撰写评论痛骂自己一事。《名利场》的记者谢尔曼进一步披露称，有消息人士表示，特朗普当前“饱受此事困扰”、“陷入困境”，并且因怀疑泄密者还在他的身边而“吓得不轻”，他的儿子小特朗普被曝曾告知身边人，他担心父亲会因此而无法入睡。 美国水星新闻网则称，特朗普最近关注的焦点已经不再是治理国家，而是对那些在新书上和伍德沃德进行合作的人发起攻击，并找出撰写匿名评论的“内鬼”究竟是谁。一位接近特朗普的白宫顾问称，特朗普正在指示助手们在公开场合称这位匿名者为“懦夫”，通过对其进行羞辱，以希望对方会在压力下打破沉默。 1536650337342819.jpg 美国总统特朗普（图源：视觉中国） 文章还指出，特朗普认为，自己经历的事情意味着“有一场政变”。一位前官员透露，特朗普与国防部长马蒂斯本就关系紧张，而现在他们几乎已经毫无联系。而这位美国总统除了信任白宫高级政策顾问斯蒂芬·米勒外，唯一信任的就是家人——女儿伊万卡以及女婿库什纳了。这意味着他的女儿女婿已经承担起了包括包括找到白宫“内鬼”以及控制危机的各种责任。而鉴于白宫当前的“混乱状态”，一位接近这位“第一女儿”的消息人士也透露，就连伊万卡也在担心自己的父亲会被弹劾一事。 CNN在本周公布的一项民意调查显示，特朗普的支持率已经从8月份的42%降至36%，只有32%的受访者认为他是“诚实且值得信赖的”。同一天，昆尼皮亚克大学的一项民意调查称，特朗普的支持率为38%，相比前一个月的41%有所下降。这份调查还指出，55%的美国人认为特朗普不适合当总统，65%的人认为他并不是一个头脑冷静的人，还有42%的受访者认为他精神并不稳定。（海外网张霓）"
var h3 ="禁毒总队长伙同女下属受贿:我谨慎但还是没把握住 禁毒总队长伙同女下属受贿:我谨慎但还是没把握住 5 原标题：湖南原禁毒总队长受审：任职郴州借工程生财，伙同女下属受贿 在庭审中，唐国栋坦承自己曾谨慎处事，但还是没“把握好”。永州市中院微信公众号 图 戴着眼镜，穿着白衬衣，唐国栋被法警押进法庭。从参加工作到案发，他有37年警龄，担任过副市长、公安局长、总队长，如今却走上了被告席。 9月13日，此案在永州市中级法院开庭审理。当天下午庭审结束，法院未当庭宣判。 唐国栋被指控犯受贿罪和巨额财产来源不明罪——2008年至2017年，他在担任郴州市公安局局长、副市长以及湖南省公安厅交警总队总队长期间，非法收受他人财物700余万元，另有960多万元财产不能说明来源或说明来源后查证不属实。 工程项目、案件处理、人事调整，是唐国栋涉案的主要领域。“受贿方式多样，具有一定隐蔽性。”公诉人当庭列举了24笔受贿款项，其中21笔来自唐国栋担任郴州市公安局局长期间，包括他与其特定关系人——一名女下属共同受贿。 郴州七年，是唐国栋自己引以为傲的高光时期。他在这里开始副厅仕途，获得不少荣誉，却因为贪欲逐渐陷入人生的滑铁卢。 9月13日，唐国栋涉嫌受贿、巨额财产来源不明一案，在湖南永州市中院开庭审理。澎湃新闻记者 朱远祥 图9月13日，唐国栋涉嫌受贿、巨额财产来源不明一案，在湖南永州市中院开庭审理。澎湃新闻记者 朱远祥 图 民警提拔，老板出面找局长 9月13日出现在法庭被告席，57岁的唐国栋看起来有些瘦弱。在一天的庭审中，他表情平静，大部分时间认真倾听。接受询问或自己辩护时，他说话条理清晰，有时语速较快。 “今天的开庭对我来说刻骨铭心，”他说，“我认真反省，接受法律制裁。” 检方对唐国栋的指控内容中，出现了多名他的老部下的名字。唐国栋任郴州市副市长、公安局局长期间，有多名公安干警通过企业老板“牵线”，寻求他的关照。 郴州市美丽年华食品公司的法定代表人尹斌，被指控以装修房屋为名向唐国栋行贿约40万元。唐国栋在企业经营、招待消费等方面予以关照。此外，尹斌请求关照的两位公安民警，在职务调整方面得到唐的“帮助”——宜章县公安局城西派出所原所长李光荣调任县治安大队大队长，资兴市公安局青山派出所原所长李正红调至城区的鲤鱼江派出所任所长。唐国栋被指控先后接受李光荣价值2.2万元的金条1块和现金7万元，接受李正红现金2万元。 在郴州任职期间，唐国栋跟多名矿老板来往密切。郴州和蓉矿业公司法宝代表人唐拥军，被指控曾向唐国栋夫妻送高档麻将桌、翡翠手镯和钻戒，折合人民币12万多元。唐拥军请唐国栋关照宜章县公安局原副局长吴兴国。2010年吴兴国从宜章调至安仁县公安局任局长。 临武县泡金山铅锌矿公司董事长邝军，被指控曾向唐国栋送象牙雕等财物。唐接受其请托，在南塔派出所所长陈海波援疆事宜上予以关照。受朋友姜富友的请托，唐国栋曾对宜章县莽山派出所原所长李斌调入城区一事“打招呼”。 郴州市公安局经侦支队原副支队长陈峰，被指控向唐国栋送了9万多元的手表，以及名贵沙发、茶具等，折合人民币16万余元。本想谋求职务提升的陈峰，2014年4月在一起经济案件中与另外三名民警受贿、渎职被判刑，成为轰动一时的“经侦窝案”主角。 “不是我索要的，是他（陈峰）主动送的。”唐国栋在庭上辩解。 今年4月24日，郴州市公安局原副局长兼交警支队支队长邓光坛涉嫌受贿、行贿一案开庭审理。据《湖南日报》报道，检方指控，邓光坛为谋取职务升迁，曾送给郴州市公安局原局长唐国栋6万元。不过，在此次唐国栋受贿罪的指控中，没有出现邓光坛的名字。 “生财”的公安局大楼 检察机关对唐国栋的受贿指控，工程领域涉案数额最大，其中包括郴州市公安局办公大楼项目。 2011年12月26日，郴州市青年大道318号。在一栋气势恢宏的崭新建筑前，郴州市公安局局长唐国栋一身警服，头戴警帽，站在庆典活动的主席台致词。他意气风发地说，要以办公楼搬迁为契机“再创新辉煌”。 很多人并不知道，唐国栋也抓住这次“契机”，让自己的腰包鼓起来。 据永州市检察院指控，在郴州市公安局新办公楼的建设过程中，唐国栋在土建、装修工程和办公家具采购等方面，非法收受六笔财物共约260万元。"
var h4 ="环卫工丢失亡儿手机每天痛哭：望捡到者发还儿子照片 2018年09月14日 22:08:00 来源：澎湃新闻社会列表 0人参与 0评论 原标题：环卫工丢失亡儿手机每天痛哭：愿捡到者能发还儿子生前照片 “我记得照片里他望着镜头笑，但又不是大口笑，4张都拍得很自然，我想他就翻出来看看。”刘阿姨顿了顿，抽泣起来：“可我怎么就弄留了呢？” 刘新连失声痛哭。 9月14日，山西侯马环卫工人刘新连丢失手机的第15天，这位母亲仍处在懊悔之中。她告诉澎湃新闻（www.thepaper.cn），儿子在世的28年里，家人不爱拍照，更没照过全家福，儿子的手机作为唯一遗物被她珍藏，里面的四张全身照也成了她的感情寄托，“我不要他们捐钱，也不要他们买手机，只想有好心人能把照片发给我”。 刘新连负责当地两条街的清洁工作，累了路边站会儿，渴了周边商店喝杯水，起早贪黑已成为她的生活习惯。 本文图片均来自中新网 刘阿姨回忆，8月31日，她从家出发去值夜班时，发现自己的手机没电，便临时携带已故儿子的手机，不料在体育街和市府路十字路口附近意外丢失。虽然有群众帮忙拨打电话寻找，网友们也积极帮她转发寻物帖，但始终没有收获。 “她基本上每天都在哭，精神状态都不好了。”和刘阿姨相熟的商店服务员李女士说，刘阿姨个性随和，经常结束工作后来商店买水，与她聊天。刘阿姨丢失手机后，她帮忙打电话，但始终无人接听，她眼见好不容易从丧子悲痛中走出来的刘阿姨变得更加悲伤。 家住侯马市秦村的刘阿姨原本有个五口之家：母亲、丈夫、儿子、女儿和她。2017年7月，28岁的大儿子因中暑不幸离世，同为环卫工人的丈夫不再工作，年迈的母亲和21岁的聋哑女儿需要照顾，她以一个月1600元的收入和其他经济来源艰难支撑。 “白天在外面扫地，晚上回到家，外面电动摩托车的嘀嘀声响起，我还觉得是儿子回家了。我也不太会用手机，有时候拿出来看照片，想他”，刘阿姨说。 她絮叨着儿子的过往：儿子念书时成绩中游，初二时辍学到社会上干活，从不在外头惹事。每年9月树叶掉落，她打扫街道费劲，儿子也不嫌辛苦，常常早起陪她一起，一帮就是十天。 据中新网报道，事发后，当地警方分析刘新连骑行路线，并调取附近路段监控视频，并未发现有人捡拾或偷窃手机。侯马市公安局刑事侦查大队图侦中队指导员李玉晨介绍，目前掌握的视频资料均为民用监控所拍摄，会有盲区存在。下一步警方将加派人手去周边询问，以求掌握更多的信息。 “找不到再说吧，我每天都在后悔，儿子唯一留给我的东西丢了。”刘阿姨一边后悔，一边抱有希望。"
var h5 ="环卫工丢失亡儿手机每天痛哭：愿捡到者能发还儿子生前照片 澎湃新闻记者 钟笑玫 2018-09-14 22:08 字号 “我记得照片里他望着镜头笑，但又不是大口笑，4张都拍得很自然，我想他就翻出来看看。”刘阿姨顿了顿，抽泣起来：“可我怎么就弄留了呢？” 刘新连失声痛哭。 9月14日，山西侯马环卫工人刘新连丢失手机的第15天，这位母亲仍处在懊悔之中。她告诉澎湃新闻（www.thepaper.cn），儿子在世的28年里，家人不爱拍照，更没照过全家福，儿子的手机作为唯一遗物被她珍藏，里面的四张全身照也成了她的感情寄托，“我不要他们捐钱，也不要他们买手机，只想有好心人能把照片发给我”。 刘新连负责当地两条街的清洁工作，累了路边站会儿，渴了周边商店喝杯水，起早贪黑已成为她的生活习惯。 本文图片均来自中新网 刘阿姨回忆，8月31日，她从家出发去值夜班时，发现自己的手机没电，便临时携带已故儿子的手机，不料在体育街和市府路十字路口附近意外丢失。虽然有群众帮忙拨打电话寻找，网友们也积极帮她转发寻物帖，但始终没有收获。 “她基本上每天都在哭，精神状态都不好了。”和刘阿姨相熟的商店服务员李女士说，刘阿姨个性随和，经常结束工作后来商店买水，与她聊天。刘阿姨丢失手机后，她帮忙打电话，但始终无人接听，她眼见好不容易从丧子悲痛中走出来的刘阿姨变得更加悲伤。 家住侯马市秦村的刘阿姨原本有个五口之家：母亲、丈夫、儿子、女儿和她。2017年7月，28岁的大儿子因中暑不幸离世，同为环卫工人的丈夫不再工作，年迈的母亲和21岁的聋哑女儿需要照顾，她以一个月1600元的收入和其他经济来源艰难支撑。 “白天在外面扫地，晚上回到家，外面电动摩托车的嘀嘀声响起，我还觉得是儿子回家了。我也不太会用手机，有时候拿出来看照片，想他”，刘阿姨说。 她絮叨着儿子的过往：儿子念书时成绩中游，初二时辍学到社会上干活，从不在外头惹事。每年9月树叶掉落，她打扫街道费劲，儿子也不嫌辛苦，常常早起陪她一起，一帮就是十天。 据中新网报道，事发后，当地警方分析刘新连骑行路线，并调取附近路段监控视频，并未发现有人捡拾或偷窃手机。侯马市公安局刑事侦查大队图侦中队指导员李玉晨介绍，目前掌握的视频资料均为民用监控所拍摄，会有盲区存在。下一步警方将加派人手去周边询问，以求掌握更多的信息。 “找不到再说吧，我每天都在后悔，儿子唯一留给我的东西丢了。”刘阿姨一边后悔，一边抱有希望。 责任编辑：李寿康澎湃新闻报料：4009-20-4009 澎湃新闻，未经授权不得转载 关键词 &gt;&gt; 山西"
comparedStrOk(h1,h2)
comparedStrOk(h1,h3)
comparedStrOk(h1,h4)
comparedStrOk(h1,h5)
comparedStrOk(h4,h5)

//////////////////////////////////////////////////////////////////////////////////////////

//遍历长字符串   搜索字符出现的次数
function stringWhereAppears (obj){
  var err = "格式错误str:xxx,word:xxx",
      str = obj.str || console.error(err), 
      word = obj.word || console.error(err),
      appears = [],
      pos = str.indexOf(word);
  while(~pos){
    appears.push(pos);
    pos = str.indexOf(word , pos+1)
  }
  return appears;
}
var h2 ="特朗普被指陷困境无心理政 伊万卡忧父亲被弹劾 2018年09月14日 13:48:46 来源：海外网 2598人参与 312评论 原标题：特朗普被曝陷困境无心理政 伊万卡忧父亲被弹劾 VCG111161794964.jpg 伊万卡（图源：视觉中国） 海外网9月14日电 近来，特朗普的日子不太好过。除了飓风“佛罗伦斯”登陆美国这样无法避免的天灾外，这位美国总统还因爆料政府众多内幕的新书，以及发表匿名文章的白宫“深喉”而感到愤怒异常，甚至被认为已经“无心理政”，其支持率也暴跌至36%。有媒体曝出，就连特朗普的女儿伊万卡都已经开始担心，自己的父亲会遭到弹劾。 据美国《名利场》网站报道，9月13日，美国知名记者伍德沃德的新书《恐惧：特朗普入主白宫》上市首日的销量就已超过75万册，并正在第9次重印。书中揭露了特朗普政府众多内幕以及特朗普在日常生活和工作中的各种表现，引发不小争议，而站在风口浪尖的特朗普更是连连指责伍德沃德捏造了他和其他人的发言，指责他是个“骗子”，而他写的书就是个笑话。消息人士透露，特朗普还对自己的前经济顾问加里·科恩等人与这本书作者间的明显合作感到愤怒。 相比这本新书的爆料，特朗普更加愤怒的是有白宫高官在《纽约时报》上匿名撰写评论痛骂自己一事。《名利场》的记者谢尔曼进一步披露称，有消息人士表示，特朗普当前“饱受此事困扰”、“陷入困境”，并且因怀疑泄密者还在他的身边而“吓得不轻”，他的儿子小特朗普被曝曾告知身边人，他担心父亲会因此而无法入睡。 美国水星新闻网则称，特朗普最近关注的焦点已经不再是治理国家，而是对那些在新书上和伍德沃德进行合作的人发起攻击，并找出撰写匿名评论的“内鬼”究竟是谁。一位接近特朗普的白宫顾问称，特朗普正在指示助手们在公开场合称这位匿名者为“懦夫”，通过对其进行羞辱，以希望对方会在压力下打破沉默。 1536650337342819.jpg 美国总统特朗普（图源：视觉中国） 文章还指出，特朗普认为，自己经历的事情意味着“有一场政变”。一位前官员透露，特朗普与国防部长马蒂斯本就关系紧张，而现在他们几乎已经毫无联系。而这位美国总统除了信任白宫高级政策顾问斯蒂芬·米勒外，唯一信任的就是家人——女儿伊万卡以及女婿库什纳了。这意味着他的女儿女婿已经承担起了包括包括找到白宫“内鬼”以及控制危机的各种责任。而鉴于白宫当前的“混乱状态”，一位接近这位“第一女儿”的消息人士也透露，就连伊万卡也在担心自己的父亲会被弹劾一事。 CNN在本周公布的一项民意调查显示，特朗普的支持率已经从8月份的42%降至36%，只有32%的受访者认为他是“诚实且值得信赖的”。同一天，昆尼皮亚克大学的一项民意调查称，特朗普的支持率为38%，相比前一个月的41%有所下降。这份调查还指出，55%的美国人认为特朗普不适合当总统，65%的人认为他并不是一个头脑冷静的人，还有42%的受访者认为他精神并不稳定。（海外网张霓）"
stringWhereAppears({
  str:h2,
  word:"是"
}) //(10) [402, 426, 439, 507, 659, 666, 706, 916, 1086, 1182]

///////////////////////////////////////////////////////////////////////
//成语接龙
var chengyu = ['一唱一和','一呼百应','一干二净','一举两得','一落千丈','一模一样','一暴十寒','一心一意','一败涂地','一本正经','一臂之力','一尘不染','一见如故','一箭双雕','一脉相承','一目了然','一窍不通','一视同仁','一泻千里','一草一木','一成不变','一帆风顺','一鼓作气','一哄而散','一如既往','一丝不苟','一言难尽','一衣带水','一朝一夕','一针见血','一知半解','一表人才','一波三折','一步登天','一筹莫展','一触即发','一刀两断','一技之长','一蹶不振','一劳永逸','一鸣惊人','一念之差','一贫如洗','一气呵成','一清二白','一扫而空','一息尚存','一相情愿','略胜一筹','两败俱伤','两虎相斗','两面三刀','两全其美','两小无猜','两袖清风','进退两难','三长两短','三顾茅庐','三令五申','三生有幸','三思而行','三头六臂','三心二意','三言两语','半夜三更','入木三分','火冒三丈','三天打鱼，两天晒网','四海为家','四分五裂','四面楚歌','四通八达','四平八稳','危机四伏','四海升平','五彩缤纷','五光十色','五湖四海','五花八门','五颜六色','五体投地','五脏六腑','五谷丰登','学富五车','五雷轰顶','六神无主','六亲无靠','六月飞霜','六根清净','七零八落','七拼八凑','七上八下','七手八脚','七嘴八舌','七窍生烟','七情六欲','八面威风','半斤八两','胡说八道','八仙过海，各显神通','九死一生','九牛一毛','九霄云外','九牛二虎之力','含笑九泉','十拿九稳','十年寒窗','十全十美','十万火急','十指连心','十冬腊月','神气十足','百无禁忌','百川归海','百读不厌','百发百中','百废俱兴','百感交集','百花齐放','百口难辩','百炼成钢','百年不遇','百年大计','百思不解','百战百胜','百依百顺','百折不挠','百孔千疮','精神百倍','百尺竿头，更进一步','百闻不如一见千变万化','千差万别','千锤百炼','千方百计','千呼万唤','千军万马','千钧一发','千里迢迢','千门万户','千难万险','千篇一律','千千万万','千秋万代','千山万水','千丝万缕','千头万绪','千辛万苦','千言万语','千真万确','千奇百怪','千姿百态','千虑一得','千虑一失','千载难逢','千难万险','横扫千军万水千山','万无一失','万众一心','万紫千红','万死一生','万籁俱寂','瞬息万变','鼠目寸光','鼠肚鸡肠','鼠窃狗盗','投鼠忌器','抱头鼠窜','獐头鼠目','胆小如鼠','牛鬼蛇神','牛刀小试','牛鼎烹鸡','汗牛充栋','对牛弹琴','九牛一毛','气壮如牛','牛毛细雨','泥牛入海','虎视眈眈','虎口余生','虎头虎脑','虎背熊腰','虎头蛇尾','虎落平阳','虎穴龙潭','放虎归山','谈虎色变','如虎添翼','骑虎难下','为虎作伥','与虎谋皮','藏龙卧虎','狐假虎威','羊入虎口','狼吞虎咽','龙行虎步','龙吟虎啸','龙争虎斗','龙盘虎踞','龙腾虎跃','生龙活虎','降龙伏虎','兔死狐悲','兔死狗烹','狡兔三窟','鸟飞兔走','守株待兔','龙腾虎跃','龙飞凤舞','龙马精神','龙凤呈祥','画龙点睛','来龙去脉','攀龙附凤','群龙无首','望子成龙','车水马龙','人中之龙','叶公好龙','降龙伏虎','老态龙钟','笔走龙蛇','龙潭虎穴','蛇蝎心肠','画蛇添足','惊蛇入草','龙蛇混杂','杯弓蛇影','牛鬼蛇神','打草惊蛇','虚与委蛇','笔走龙蛇','春蚓秋蛇','马到成功','马不停蹄','马革裹尸','一马当先','老马识途','汗马功劳','万马齐喑','一马平川','天马行空','快马加鞭','走马看花','信马由缰','蛛丝马迹','兵荒马乱','万马奔腾','犬马之劳','单枪匹马','招兵买马','人仰马翻','人困马乏','鞍前马后','人强马壮','猴年马月','青梅竹马','心猿意马','悬崖勒马','千军万马','香车宝马','指鹿为马','害群之马','厉兵秣马','塞失马盲人瞎马','脱僵之马','金戈铁马','羊质虎皮','羊肠小道','羊入虎口','亡羊补牢','虎入羊群','顺手牵羊','猴年马月','沐猴而冠','尖嘴猴腮','杀鸡吓猴','杀鸡儆猴','鸡毛蒜皮','鸡鸣狗盗','鸡飞蛋打','鸡犬不宁','鸡犬不留','鸡犬升天','闻鸡起舞','杀鸡吓猴','杀鸡取卵','偷鸡摸狗','鹤立鸡群','小肚鸡肠','鼠肚鸡肠','呆若木鸡','狗急跳墙','狗尾续貂','狗仗人势','狗血喷头','犬马之劳','猪狗不如','兔死狗烹','鼠窃狗盗','狼心狗肺','狐朋狗友','狐群狗党','偷鸡摸狗','画虎类狗','鸡犬不惊','鸡零狗碎','猪突豨勇','猪狗不如','杀猪宰羊','封豕长蛇','凤头猪肚','蠢笨如猪','鸟尽弓藏','笨鸟先飞','如鸟兽散','小鸟依人','惊弓之鸟','飞禽走兽','凤毛麟角','鸦雀无声','燕雀安知','鹤立鸡群','鹤发童颜','风声鹤唳','莺歌燕舞','草长莺飞','珍禽异兽','衣冠禽兽','燕语莺声','鹊巢鸠占','鹦鹉学舌','蜻蜓点水','欢呼雀跃','鸦雀无声','鹏程万里','一箭双雕','风声鹤唳','鹤发鸡皮','鹤发童颜','鹤立鸡群','麻雀虽小，五脏俱全','螳螂捕蝉，黄雀在后','声誉鹊起','饮鸩止渴','雁过拔毛','鸟枪换炮','困兽犹斗','如鸟兽散','人面兽心','飞禽走兽','珍禽异兽','衣冠禽兽','洪水猛兽','狼吞虎咽','猫鼠同眠','黔驴技穷','一丘之貉','管中窥豹','狼心狗肺','狼烟四起','狼子野心','狼狈不堪','狼狈为奸','豺狼成性','豺狼当道','引狼入室','鹿死谁手','中原逐鹿','象牙之塔','盲人摸象','声名狼藉','杯盘狼藉','豺狼成性','狐疑不决','黔驴技穷','鹏程万里','金蚕脱壳','蝇头微利','花飞蝶舞','螳臂挡车','鱼跃鸟飞','如鱼得水','独占鳌头','井底之蛙','瓮中捉鳖','虾兵蟹将','鹬蚌相争','沉鱼落雁','飞蛾扑火','金蝉脱壳','积蚊成雷','蟾宫折挂','蚕食鲸吞','蜻蜓点水','螳臂挡车','蛛丝马迹','螳螂捕蝉，黄雀在后','鱼目混珠','蜂拥而至','蛊惑人心','物腐虫生','漏网之鱼','海市蜃楼','堤溃蚁穴','蚕食鲸吞','鹤立鸡群','鸡鸣狗盗','鹬蚌相争','蚕食鲸吞','蛛丝马迹','龙争虎斗','龙马精神','龙飞凤舞','龙腾虎跃','龙骧虎步','龙潭虎穴','龙跃凤鸣','车水马龙','指鹿为马','兔死狐悲','鸡犬不宁','心猿意马','狼吞虎咽开花结果','斩草除根','顺藤摸瓜','披荆斩棘','奇花异果','投桃报李','粗枝大叶','春兰秋菊','火树银花','叶落归根','节外生枝','李代桃僵','树大根深','瓜熟蒂落','根深蒂固','柳暗花明','桃红柳绿','瓜田李下','风扫落叶','布帛蔬栗','出水芙蓉','一枕黄粱','视入草芥','雨后春笋','昙花一现','明日黄花','横生枝节','草菅人命','草木皆兵','桑榆暮景','黄粱美梦','荆棘丛生','花枝招展','豆蔻年华','天女散花','如火如荼','名列前茅','锦上添花','囫囵吞枣','火中取栗','目光如豆','沧海一粟','胸有成竹','春暖花开','三顾茅庐','世外桃源','鸟语花香','风吹草动','鸡毛蒜皮','繁花似锦','借花献佛','滚瓜烂熟','枯木逢春','望梅止渴','拔苗助长','五谷不分','花容月貌','叶落知秋','树大招风','藕断丝连','萍水相逢','草长莺飞','花团锦簇','面无人色','心旷神怡','耳熟能详','心花怒放','蒙头转向','满面春风','屈指可数','满目疮痍','铁面无私','令人发指','出人头地','魂不附体','食不果腹','不绝于耳','爱不释手','面黄肌瘦','口干舌燥','劈头盖脸','提心吊胆','评头论足','肺腑之言','心口如一','身外之物','足不出户','手无寸铁','心事重重','满腔热忱','促膝谈心','信手拈来','灭顶之灾','另眼相看','腥风血雨','喜笑颜开','大打出手','失之交臂','汗流浃背','光彩夺目','心惊肉跳','面红耳赤','拳打脚踢','鹤发童颜','赏心悦目','抓耳挠腮','浓眉大眼','血肉相连','毛骨悚然','手足无措','掩人耳目','铁石心肠','病入膏肓','沁人肺腑','血流成河','口若悬河','面不改色','眉飞色舞','两手空空','信口开河','垂头丧气','满腹牢骚','燃眉之急','挖空心思','绞尽脑汁','义愤填膺','引人注目','泰山压顶','皮开肉绽','心灵手巧','举手投足','点头哈腰','肥头大耳','心腹之患','心心相印','唇齿相依','骨肉相连','至亲骨肉','徒费唇舌','痛入骨髓','趾高气扬','筋疲力尽','目不暇接','破口大骂','闭目塞听','扬眉吐气','怒发冲冠','切齿痛恨','掩耳盗铃','病从口入','扣人心弦','浪子回头','成竹在胸','不堪回首','眼明手快','胆战心惊','摩拳擦掌','慈眉善目','没头没脑','肝肠寸断','耳目众多','肝胆相照','恨入骨髓','感人肺腑','了如指掌','眼花缭乱','骨瘦如柴','脚踏实地','夺眶而出','惊心动魄','俯首听命','接踵而来','挺身而出','唾手可得','咬紧牙关','为国捐躯','良药苦口','掉以轻心','恨之入骨','耳聪目明','唇亡齿寒','头重脚轻','粉身碎骨','蓬头垢面','五脏六腑','咬牙切齿','血口喷人','腹背受敌','肝脑涂地','沁人心脾','近在眉睫','情同手足','眼高手低','目瞪口呆','胸无点墨','头重脚轻','手足情深','口是心非','眼疾手快','耳闻目睹','头破血流','眉清目秀','袖手傍观','口出不逊','七嘴八舌','交头接耳','手无缚鸡之力','旁若无人','前车之鉴','旁敲侧击','人间地狱','节外生枝','福如东海','马放南山','居高临下蒙在鼓里','前呼后拥','外柔中刚','前仰后合','上蹿下跳','东张西望','走南闯北','字里行间','左右开弓','转战南北','后起之秀','内顾之忧','掌上明珠','雨后春笋','梁上君子','泰山北斗','袖手旁观','大敌当前','锥处囊中','左邻右舍','上漏下湿','左顾右盼','里勾外连','天上人间','秀外慧中','天南地北','内外交困','举国上下','东窗事发','下不为例','苦中作乐','绵里藏针','稳操左卷','名列前茅','力争上游','后来居上','置之脑后','南征北战','里应外合','外强中干','南来北往','安内攘外','说东道西','瞻前顾后','左右为难','中流砥柱','间不容发','天下大乱','江东父老','日薄西山','以绝后患','九霄云外','游戏人间','喜出望外','外圆内方','东鳞西爪','内忧外患','惩前毖后','彻里彻外','声东击西','俯仰之间黄金时代','白雪皑皑','乌烟瘴气','皓首穷经','青面獠牙','苍髯如戟','金光灿烂','红颜薄命','白发苍苍','花里胡哨','五黄六月','一碧万顷','明眸皓齿','一寸丹心','火树银花','炉火纯青','须眉茭白','人老珠黄','红男绿女','白纸黑字','苍松翠柏','绿水青山','碧血丹心','白云苍狗','朱唇皓齿','面红耳赤','五光十色','青红皂白','五彩缤纷','五颜六色','一碧千里','万紫千红','花红柳绿','翠色欲流','姹紫嫣红','亭亭玉立','姗姗来迟','栩栩如生','欣欣向荣','惺惺作态','洋洋得意','绵绵不绝','静静乐道','虎视眈眈','来势汹汹','生机勃勃','热气腾腾','炯炯有神','沾沾自喜','头头是道','依依惜别','节节败退','比比皆是','飘飘欲仙','井井有条','愤愤不平','小心翼翼','死气沉沉','大名鼎鼎','滔滔不绝','步步登高','夸夸其谈','花花公子','娓娓动听','历历在目','窃窃私语','威风凛凛','喜气洋洋','天网恢恢','神采奕奕','摇摇欲坠','奄奄一息','念念不忘','跃跃欲试','循循善诱','人人自危','斤斤计较','心心相印','白发苍苍','白雪皑皑','气势汹汹','人才济济','得意洋洋','三三两两','沸沸扬扬','纷纷扬扬','郁郁葱葱','昏昏沉沉','断断续续','战战兢兢','羞羞答答','浩浩荡荡','家家户户','歪歪扭扭','吞吞吐吐','轰轰烈烈','庸庸碌碌','影影绰绰','星星点灯','不由自主','不谋而合','不寒而栗','不同凡响','不甘示弱','不知深浅','不露声色','不择手段','不足为奇','不绝于耳','不可思议','不共戴天','不计其数','不可收拾','不约而同','不知去向','不学无术','情不自禁','恬不知耻','弱不禁风','爱不释手','怒不可遏','力不从心','辞不达意','猝不及防','名不虚传','祸不单行','死不悔改','时不我待','下不为例','义不容辞','深不可测','机不可失','参差不齐','萎靡不振','纹丝不动','惶恐不安','一尘不染','连绵不断','疲惫不堪','坎坷不平','坐立不安','一毛不拔','表里不一','寸步不让','欲罢不能','无所不有','放荡不羁','犹豫不决','锲而不舍','赞谈不已','愁眉不展','绵绵不绝','按兵不动','川流不息','截然不同','措手不及','屡教不改','原封不动','形影不离','络绎不绝','华而不实','揣测不安','坚忍不拔','从容不迫','经久不息','人心涣散','人生如梦','人情冷暖','人地生疏','人面兽心','人困马乏','人才济济','人浮于事','人才辈出','人尽其才','人命关天','人声鼎沸','人所共知','人迹罕至','人烟稠密','人各有志','人之常情','强人所难','与人为善','为人师表','盲人瞎马','助人为乐','耐人寻味','沁人心脾','渔人之利','耸人听闻','痴人说梦','任人唯贤','高人一等','成人之美','先人后己','拖人下水','引人注目','不近人情','地广人稀','振奋人心','差强人意','风云人物','惨无人道','大快人心','事在人为','深入人心','不省人事','家破人亡','脍炙人口','风土人情','狗仗人势','荒无人烟','地利人和','治病救人','冷语冰人','舍己为人','以貌取人','目中无人','达官贵人','出口伤人','嫁祸于人','不甘后人','仗势欺人','睹物思人','盛气凌人','百年树人','平易近人','先发制人','视同路人朝思暮想','苦思冥想','静思默想','深思熟虑','胡思乱想','浮想联翩','左思右想','痴心妄想','异想天开','座无虚席','贵宾多(高朋满座)人很多(摩肩接踵)人才多(人才济济千军万马','林林总总','五彩缤纷','千差万别','千辛万苦','滔滔不绝','博览群书','见多识广','千变万化','走南闯北','五颜六色','五花八门','见多识广','望而生畏','察言观色','一视同仁','一览无余','高瞻远瞩','坐井观天','举世瞩目','管中窥豹','左顾右盼','惊心动魄','争奇斗艳','生龙活虎','添油加醋','降龙伏虎','争权夺利','高楼大厦','狂风暴雨','满山遍野','翻江倒海','怪模怪样','民脂民膏','五颜六色','千言万语','无边无际','一清二楚','火烧火燎','千变万化','唉声叹气','接二连胜','星罗棋布','翻云覆雨','道听途说','摩拳擦掌','如花似玉','慈眉善目','争分夺秒','地动山摇','无忧无虑','风驰电掣','报仇雪恨','酒囊饭袋','咬文嚼字','无依无靠','山崩地裂','海阔天空','无精打采','流言飞语','谨言慎行','赤手空拳','日积月累','添枝加叶','品头论足','心灵手巧','口干舌燥','心旷神怡','难分难解','感恩戴德','欢蹦乱跳','风平浪静','千姿百态','不声不响','涂脂抹粉','伤天害理','大摇大摆','颠三倒四','捕风捉影','添砖加瓦','平心静气','抓耳挠腮','不偏不倚','见多识广','察言观色','高瞻远瞩','左顾右盼','调兵遣将','粉身碎骨','狂风暴雨','旁敲侧击','改朝换代','道听途说','千辛万苦','眼疾手快','生龙活虎','惊天动地','七拼八凑','胡言乱语','深思熟虑','真凭实据','灵丹妙药','凶神恶煞','心满意足','街头巷议','翻山越岭','精雕细刻','生拉硬扯','琼楼玉宇','层峦叠嶂','心烦意乱','崇山峻岭','奇形怪状','惊涛骇浪','装模作样','摇头晃脑','文丛字顺','改朝换代','通风报信','能说会道','甜言蜜语','分门别类','追根究底','虚情假意','幸灾乐祸','通情达理','丰功伟绩','歪门邪道','生擒活捉','离乡背井','豪言壮语','汪洋大海','琼浆玉液','斩尽杀绝','出神入化','横七竖八','来龙去脉','浓妆淡抹','逆来顺受','朝秦暮楚','有恃无恐','天经地义','转危为安','若明若暗','弄巧成拙','扶老携幼','顾此失彼','弃暗投明','因小失大','自始至终','七上八下','逢凶化吉','舍己为人','避实击虚','大公无私','走南闯北','取长补短','除暴安良','顶天立地','大材小用','古为今用','夫唱妇随','有气无力','殊途同归','异曲同工','南辕北辙','朝令夕改','今非昔比','同床异梦','鬼斧神工','异口同声','大手大脚','从头到尾','改邪归正','惹是生非','弄假成真','远亲近邻','前仰后合','天寒地冻','先斩后奏','功败垂若隐若现','反败为胜','铺天盖地','弃旧图新','以逸待劳','化整为零','积少成多','拈轻怕重','起死回生','以攻为守','争先恐后','横眉立目','苦尽甘来','东倒西歪','官逼民反','前赴后继','公报私仇','水深火热','前呼后拥','东倒西歪','眼高手低','口是心非','头重脚轻','有头无尾','前倨后恭','东逃西散','南辕北辙','左顾右盼','积少成多','同甘共苦','半信半疑','大材小用','先人后己','有口无心','弄假成真','举足轻重','南腔北调','声东击西','转危为安','东倒西歪','反败为胜','以少胜多','由此及彼','神出鬼没','人小鬼大','南来北往','此起彼伏','好逸恶劳','有名无实','喜新厌旧','经天纬地','你死我活','古往今来','凶多吉少','大同小异','寒来暑往','生死存亡','悲欢离合','盛衰荣辱','轻重缓急','是非曲直','厚此薄彼','深入浅出','先公后私','死去活来','有始无终','藏头露尾','前因后果','避实就虚','送往迎来','扶弱抑强','先人后己','春华秋实','天南地北','避重就轻','外强中干','吉凶祸福','摇头摆尾','返老还童','欢天喜地','瞻前顾后','同生共死','惊天动地','说长道短','寻死觅活','昏天黑地','挑肥拣瘦','开天辟地','街头巷尾','同甘共苦','冷嘲热讽','尔虞我诈','横冲直撞','左顾右盼','新仇旧恨','大街小巷','东张西望','阴差阳错','左思右想','天罗地网','长吁短叹','南腔北调','明争暗斗','东奔西跑','手舞足蹈','生离死别','来踪去迹','东躲西藏','南征北战','鬼使神差','天崩地塌','爱财如命','挥金如土','异口同声','众说纷纭','寂然无声','鸦雀无声','爱释手','弃若敝屐','半途而废','坚持不懈','高瞻远瞩','鼠目寸光','一丝不苟','粗枝大叶','博古通今','坐井观天','百发百中','百步穿杨','急功近利','急于求成','不名一钱','一贫如洗','不求甚解','囫囵吞枣','白日做梦','痴心妄想','东倒西歪','东扶西倒','熙熙攘攘','熙来攘往','博古通今','博古知今','古色古香','天兵天将','不死不活','稳扎稳打','任劳任怨','有始有终','无穷无尽','大模大样','自高自大','破罐破摔','大喊大叫','自作自受','偏听偏信','本乡本土','有声有色','群策群力','虎头虎脑','无依无靠','毛手毛脚','人山人海','载歌载舞','瓮声瓮气','如泣如诉','问长问短','若隐若现','不慌不忙','难解难分','久而久之','如醉如痴','活灵活现','无影无踪','无拘无束','同心同德','无声无息','无边无际','兵不血刃','折戟沉沙','单枪匹马','当头棒喝','心如刀绞','归心似箭','当头一棒','剑拔弩张','明枪暗箭','戟指怒目','强弩之末','一箭双雕','琴心剑胆','鸟尽弓藏','临阵磨枪','唇枪舌战','亡戟得矛','箭在弦上','短兵相接','借刀杀人','心如刀割','口蜜腹剑','盘马弯弓','无的放矢','夹枪带棒','自相矛盾','杯弓蛇影','枕戈待旦','惊弓之鸟','图穷匕见','同室操戈','有的放矢','刀光剑影','大刀阔斧','大动干戈','春天:阳春三月','春光明媚','春回大地','春暖花开','春意盎然','春意正浓风和日丽','春花烂漫','鸟语花香','百鸟鸣春','百花齐放','莺歌燕舞','万紫千红','春雨如油','生机勃勃','春色满圆','春意盎然','和风细雨','赤日炎炎','烈日炎炎','骄阳似火','挥汗如雨','大汗淋漓','鸟语蝉鸣','万木葱茏','枝繁叶茂','莲叶满池','秋天:秋高气爽','天高云淡','秋风送爽','秋菊怒放','秋菊傲骨','秋色迷人','秋色宜人','金桂飘香','果实累累','北雁南飞','满山红叶','五谷丰登','芦花飘扬冬天:天寒地冻','北风呼啸','滴水成冰','寒冬腊月','瑞雪纷飞','冰天雪地','冰封雪盖','漫天飞雪','白雪皑皑','冰封大地','早晨:东方欲晓','旭日东升','万物初醒','空气清醒','雄鸡报晓','晨雾弥漫','晨光绚中午:烈日当头','丽日临空','艳阳高照','万里无云','碧空如洗傍晚:日落西山','夕阳西斜','残阳如血','炊烟四起','百鸟归林','华灯初上','夜幕低垂','日薄西山夜晚:夜深人静','月明星稀','夜色柔美','夜色迷人','深更半夜','漫漫长','花:花红柳绿','花色迷人','花香醉人','花枝招展','百花齐放','百花盛开','百花争艳','绚丽多彩','五彩缤纷','万紫千红','春暖花开','鸟语花香','姹紫嫣红','花红柳绿','百花争艳','锦上添花','火树银花','昨日黄花','春花秋月','过时黄花','花团锦簇','花枝招草:绿草如茵','一碧千里','杂草丛生','生机勃勃','绿油油树:苍翠挺拔','郁郁葱葱','枯木逢春','秀丽多姿','青翠欲滴','林海雪原','耸入云山:寸草不生','山清水秀','青山绿水','高耸入云','崇山峻岭','山明水秀山穷水尽','大好山河','刀山火海','地动山摇','高山深涧','悬崖峭壁','峰峦雄伟','漫山遍野','江山如画','锦绣山河荒山野地水:水流湍急','水平如镜','高山流水','千山万水','水滴石穿','水乳交融','滴水不漏','杯水车薪','洪水猛兽','流水无情','清香鲜嫩','青翠欲滴','果园飘香','果实累累','果实饱满','鲜嫩水','雪:大雪纷飞','大雪封山','鹅毛大雪','漫天飞雪','瑞雪纷飞','风雪交雷电:电光石火','雷电大作','惊天动地','春雷滚滚','电劈石击','雷电交雨:阴雨连绵','牛毛细雨','秋雨连绵','随风飘洒','倾盆大雨','狂风暴雨','大雨淋漓','暴雨如注','大雨滂沱','瓢泼大雨大雨倾盆','血雨腥风','风雨交加','风调雨顺','枪林弹雨','风雨同舟','风雨无阻','和风细雨','狂风暴雨','满城风雨','春风化雨','风雨飘摇','斜风细雨','未雨绸风:秋风送爽','金风送爽','北风呼啸','微风习习','寒风刺骨','风和日云:彩云满天','天高云淡','乌云翻滚','彤云密布九霄云外','腾云驾雾','壮志凌云','风云变幻','风起云涌','行云流水','风卷残云','浮云蔽日','孤云野鹤','烘云托月','过眼云烟','烟消云','旭日东升','日上三竿','一轮红日','日高三尺','艳阳高照','烈日当头','骄阳似火','日影西斜','碧空万里','浩浩长空','晴空万里','万里无云','碧空如洗','千钧一发:刻不容缓','迫不及待','十万火急','火烧眉毛','燃眉之急','鹬蚌相争','刻舟求剑','鹏程万里','守株待兔','掩耳盗铃','亡羊补牢','惊弓之鸟','杯弓蛇影','抱薪救火','安步当车','暗渡陈仓','按图索骥','程门立雪','班门弄斧','兵不厌诈','三顾茅','微乎其微','神乎其神','天外有天','痛定思痛','数不胜数','举不胜举','人外有人','防不胜防','忍无可忍','闻所未闻','观者如云','挥金如土','铁证如山','爱财如命','稳如泰山','门庭若市','骨瘦如柴','冷若冰霜','如雷贯耳','守口如瓶','浩如烟海','高手如林','不可多得','凤毛麟角','九牛一毛','绝无仅有','空前绝后','寥寥无几','寥若晨星','宁缺毋滥','前所未有','屈指可数','三三两两','铁树开花','微乎其微','一麟半爪','一丝一毫','百里挑一','沧海一粟','千古绝唱','摩肩接踵','车水马龙','川流不息','纷至沓来','花花世界','举袖为云','挥汗如雨','络绎不绝','门庭若市','万人空巷','水泄不通','人声鼎沸','人欢马叫','人山人海','震耳欲聋','座无虚','包罗万象','琳琅满目','美不胜收','目不暇接','无奇不有','无穷无尽','无所不包','五花八门','眼花缭乱','洋洋大观','一应俱全','应有尽有','应接不暇','比比皆是','不可计数','层出不穷','绰绰有余','多多益善','多如牛毛','俯拾皆市','举不胜举','漫山遍野','星罗棋布','丰富多','直言不讳','无所顾忌','拐弯抹角','真心诚意','故弄玄虚','侃侃而谈','滔滔不绝','虚情假意','推心置腹','旁敲侧击','喋喋不休','慢条斯理','含糊其词','振振有辞','肆无忌惮','大言不惭','娓娓动听','绘声绘色','对答如流','自圆其说闲言碎语','怒发冲冠','一目十行','一日千里','一字千金','百发百中','一日三秋','不毛之地','不计其数','胆大包天','寸步难行','一步登天','千钧一发','心旷神怡','心平气和','目不转睛','呆若木鸡','眉开眼笑','愁眉苦脸','愁眉紧锁','目瞪口呆','垂头丧气','嬉皮笑脸','一身正气','临危不惧','光明磊落','堂堂正正','大智大勇','力挽狂澜','急中生智','仰不愧天','镇定自若','化险为夷','推心置腹','肝胆相照','情同手足','志同道合','风雨同舟','荣辱与共','同甘共苦','关怀备注','心心相印','海誓山盟','拔刀相助','亲密无间','忐忑不安','心惊肉跳','心神不定','心猿意马','心慌意乱','七上八下','心急如焚','见贤思齐','名列前茅','平步青云','弃暗投明','弃旧图新','青云直上水涨船高','痛改前非','突飞猛进','脱胎换骨','再接再厉','神采奕奕','眉飞色舞','昂首挺胸','惊慌失措','漫不经心','垂头丧气','没精打采','愁眉苦脸','大惊失色','炯炯有神','口若悬河','对答如流','滔滔不绝','谈笑风生','高谈阔论','豪言壮语','夸夸其谈','学无止境','真才实学','学而不倦','发奋图强','废寝忘食','争分夺秒','孜孜不倦','笨鸟先飞','闻鸡起舞','自强不息','不甘示弱','全力以赴','力争上游','披荆斩','闭月羞花','沉鱼落雁','出水芙蓉','明眸皓齿','美如冠玉','倾国倾城','国色天香','鹤发童颜','眉清目秀','和蔼可亲','心慈面善','张牙舞爪','愁眉苦脸','冰清玉洁','雍容华贵','文质彬彬','威风凛凛','老态龙钟','虎背熊腰','如花似玉','容光焕发','落落大方','骨瘦如柴','大腹便便','面黄肌瘦','其貌不扬','蓬头垢面','弱不禁','班门弄斧','孤芳自赏','居功自傲','目中无人','妄自尊大','忘乎所以','惟我独尊','自高自大','自鸣得意','自我陶醉','自命不凡','目空一切','人山人海','人声喧哗','人声嘈杂','人如潮涌','摩肩接踵','暗室不欺','不同流俗','不欺暗室','不忘沟壑','赤子之心','德厚流光','高情远致','高山景行','功德无量','厚德载物','蕙心纨质','见危授命','精金良玉','敬老慈幼','良金美玉','明德惟馨','年高德劭','前人栽树，后人乘凉','青天白日','山高水长','拾金不昧','玉洁松贞','云中白鹤','志士仁人','鞠躬尽瘁，死而后已','不虞之誉','不言而信','不恶而严','荣华富贵','山中宰相师道尊','一身正气','无所畏惧','气冲牛斗','气冲霄汉','襟怀坦白','气壮山河','气宇轩昂','气吞山河','正气凛然','龙骧虎步','百战百胜冲锋陷阵','英姿焕发','奋不顾身','奋勇当先','顶天立地','昂首挺胸','昂首阔步','赴汤蹈火','挺身而出','战无不胜','临危不惧','威震天下','面不改色','勇冠三军','骁勇善战','镇定自若','慷慨就义','大智大勇','仰不愧天','一视同仁','一清二白','大义灭亲','大公无私','义无反顾','堂堂正正','深明大义','童叟无欺','谦虚谨慎','廉洁奉公','毅然决然','正气凛然','正直无私','执法如山','刚正不阿','冰清玉洁','克己奉公','严于律己','两袖清风','忍辱负重','奉公守法','表里如一','斩钉截铁','头角峥嵘','忠心耿耿','忠贞不渝','贫贱不移','高风亮节','涓滴归公','虚怀若谷','豁达大度','鞠躬尽瘁，死而后已一代风流','一世龙门','庸中佼佼','目不邪视','仰不愧天','一视同仁','正义凛','海阔天空','含垢纳污','呼牛呼马','豁达大度','既往不咎','宽大为怀','宽宏大量','网开一面','息事宁人','下不为例','以德报怨','严以律己，宽以待人','知情达','草木知威','驰名中外','大名鼎鼎','德高望重','风云人物','功成名遂','功标青史','赫赫有名','举世闻名','如雷贯耳','声振寰宇','威望素着','风流人物','风华正茂','伏龙凤雏','盖世英雄','盖世无双','鹤立鸡群','鹤鸣之士','金榜题名','举世无双','绝世超伦','昆山片玉','人中之龙','首屈一指','铁中铮','将伯之助','解衣推食','救死扶伤','绝甘分少','普度众生','轻财好施','设身处地','疏财仗义','为民请命','雪中送炭','与人为善','云行雨施','仗义疏财','助人为','生荣死哀','死得其所','万古千秋','万古流芳','为国捐躯','乘风破浪','顶天立地','鸿鹄之志','九天揽月','夸父追日','老骤伏枥','老当益壮','力争上游','陵云之志','猛志常在','磨杵成针','十载寒窗','铁杵成针','心小志大','胸怀大志','雄心壮志','移山倒海','迎头赶上','愚公移山','争强好胜','知难而进','治国安民','志在四方','中流击楫','壮志凌云','自力更生','自强不息','自求多福','自食其力','有志者事竟成','燕雀安知鸿鹄之志','大显神通','大显身手','大有作为','大器晚成','奋发有为','公才公望','后生可畏','龙跃凤鸣','鹏程万里','前程万里','如日方升','发愤图强','奋发图强','奋发蹈厉','披荆斩棘','闻鸡起舞','我武惟扬','碧血丹心','不避斧钺','成仁取义','赤胆忠心','赤心相待','赤心报国','蹈节死义','肝脑涂地','故旧不弃','故剑情深','寒花晚节','扪心无愧','心虔志诚','以身殉职','忠心耿耿','忠肝义胆','从容就义','海枯石烂','坚持不渝','坚韧不拔','坚定不移','雷打不动','木人石心','破釜沉舟','锲而不舍','誓死不二','心坚石穿','心如铁石','之死靡它','指天誓日','志坚行苦','至死不变','忠贞不渝','言必信，行必果','一口咬定','坚苦卓绝','宁死不屈','铁石心肠','威武不屈','不屈不挠','百折不挠','百炼成','冰魂雪魄','冰清玉润','冰清玉洁','冰壶秋月','高风亮节','古井无波','坚贞不屈','俭可养廉','见利思义','宁为玉碎，不为瓦全','屈节辱命','岁寒松柏','守身如','抱诚守真','诚心诚意','讲信修睦','金石为开','开心见诚','披心相付','披肝沥胆','璞玉浑金','拳拳服膺','全心全意','推诚相见','推心置腹','真心实意','表里如一','开诚相见','恪守不渝','倾心吐胆','实心实意','天人共鉴','闭邪存诚','心口如一','胸无城府','言而有信','言行一致','坐言起行','肝胆相照','不耻下问','不矜不伐','功成不居','功薄蝉翼','好问则裕','戒骄戒操','礼贤下士','抛砖引玉','谦让末遑','谦虚谨慎','深藏若虚','损之又损','闻过则喜','洗耳恭听','虚怀若谷','逊志时敏','移樽就教','载酒问字','择善而从','不骄不躁','功成不居','洗耳恭听','虚怀若谷','知之为知之','有则改之，无则加勉','满招损，谦受益','防意如城','非异人任','修心养性','引咎自责','知过必改','自愧弗如','自怨自','爱惜羽毛','画地为牢','谨言慎行','慎终追远','守口如瓶','临事而惧','临深履薄','如临探渊','如履薄冰','奉命唯谨','三思而行','小心谨慎','小心翼翼','瞻前顾','奉公守法','富贵浮云','廉洁奉公','两袖清风','先公后私','一尘不染','洗手奉','大公无私','公正无私','顾全大局','涓滴归公','开诚布公','克己奉公','摩顶放踵','舍己为人','先人后己','修身洁行','先天下之忧而忧，后天下之乐而乐','不愧屋漏','大义凛然','风骨峭峻','刚肠嫉恶','光风霁月','光明磊落','浩然之气','襟怀坦白','明镜高悬','守正不阿','严气正性','正大光明','守经达权','堂堂正正','危言危行','行不更名，坐不改姓','行不由径','仗义执言','事无不可对人言','高义薄云','慷慨解囊','乐善好施','见义勇为','路见不平，拔刀相助','不偏不倚','大义灭亲','秦镜高悬','替天行道','天公地道','天网恢恢，疏而不','发愤忘食','分秒必争','鸡鸣而起','磨穿铁砚','勤学苦练','夙兴夜寐','学而不厌','圆木警枕','幼学壮行','朝乾夕惕','只争朝夕','孜孜不倦','坐以待旦','手不释','攻苦食淡','苦心孤诣','囊萤照读','任劳任怨','埋头苦干','卧薪尝胆','悬梁刺股','仰屋着书','映月读书','映雪读书','勇猛精进','引锥刺股','凿壁偷光','折节读','不敢旁鹜','不知肉味','目不窥园','倾耳而听','倾耳注目','一心一意','屏气凝神','全神贯注','专心致志','持之以恒','坚持不懈','精卫填海','始终如一','始终不渝','水滴石穿','世上无难事，只怕有心人','出生入死','奋不顾身','赴汤蹈火','浑身是胆','临危不惧','履险如夷','能征惯战','排除万难','前仆后继','群威群胆','杀敌致果','舍死忘生','视死如归','所向无前','挺身而出','铜头铁额','万死不辞','万夫不当','无所畏惧','降龙伏虎','一往无前','一以当十','以一当十','义无反顾','勇往直前','勇猛果敢','勇冠三军','浴血奋战','超然物外','超尘拔俗','宠辱不惊','孤芳自赏','洁身自好','狷介之士','落落难合','特立独行','与世无争','风雨同舟','患难与共','同甘共苦','同舟共济','休戚相关','休戚与共','有福同','身先士卒','一鼓作气','一马当先','纵横驰骋','和颜悦色','和蔼可亲','菩萨低眉','善气迎人','秋毫无犯','铁面无私','铁面御史','爱憎分明','褒善贬恶','火眼金睛','信赏必罚','羞与为伍','彰善瘅','布衣蔬食','粗衣粝食','粗衣淡饭','粗茶淡饭','恶衣恶食','饭糗茹草','荆钗布裙','克勤克俭','牵萝补屋','轻车简从','食不重味','因陋就简','饮冰茹檗','节衣缩食','精打细算','开源节流','宽打窄用','厉行节约','勤俭持家','省吃俭用','细水长流','修旧利废','设身处地','于心何忍','规行矩步','浑俗和光','乐天知命','绳趋尺步','束身自好','随遇而','情怨理遣','温柔敦厚','仁至义尽','仁言利博','仁心仁闻','万家生佛','平易近人','软玉温香','温良恭俭让','温润而泽','忍气吞声','忍辱含羞','忍辱负重','唾面自干','委曲求全','打成一片','二人同心，其利断金','坚如磐石','精诚团结','磐石之固','铜墙铁壁','同心同德','同心合意','万众一心','众志成城','和衷共济','戮力同心','齐心协力','群策群力','通力合作','同心协力','一体同心','一德一心','一心一德','众擎易举','博施济众','打抱不平','济困扶危','济弱扶倾','解囊相助','救困扶危','相濡以沫','夏雨雨人','燮理阴阳','抑强扶弱','以沫相濡','治病救人','助我张目','左提右无孔不入','一日三秋','天涯海角','天翻地覆','一字千金','无米之炊','一毛不拔','顶天立地','一身是胆','一日千里','天壤之别','包罗万象','金玉良言','一目十行','无可救药','千钧一发','风驰电掣','一落千丈','脱胎换骨','十全十美','晴天霹雳','一尘不染','度日如年','一柱擎天','无米之炊','一掷千金','风驰电掣','一览无余','无边无际','一日三秋','取之不尽','一文不值','度日如年','羊肠小道','一本万利','一手遮天','顶天立地一言九鼎','金玉良言','轻如鸿毛','惨不忍睹','一馈十起','狼吞虎咽','两全其美','万籁俱','一刻千金','安份守己','群龙无首','气冲霄汉','豺狐之心','吴牛喘月','一败涂地','废寝忘食','鼠目寸光','不足为据','如饥似渴','一傅众咻','不惜工本','不声不响','一柱擎天','与虎谋皮','一步登天','一手遮天','文不加点','铺天盖地','千秋万代','开天辟地','万寿无疆','天翻地覆','一步登天','天壤之别','一步登天','不易一字','翻天覆地','无边无际','斩草除根','福如东海','面目全非','移山填海','不败之地','弥天大谎','一本万利','四海为家','狗尾续貂','一鸣惊人','一网打尽','一步登天','心口如一','无边无际','南辕北辙','穷奢极欲','一本万利','九死一生','天遂人愿','放眼世界','愚公移山','孤注一掷','包罗万象','无边无际','一网打尽','九死一生','气吞山河','一落千丈','一日三秋','一泻千里','万紫千红','包罗万象','狡兔三窟','惊天动地','一本万利','海枯石烂','车水马龙','一手遮天','脱胎换骨','日理万机','万寿无疆','多事之秋','万寿无疆','晴天霹雳','一叶障目','百年树人','一本万利','削铁如泥','点石成金','入情入理','尽人皆知','一尘不染','虎头蛇尾','君子之交','三头六臂','理屈词穷','南腔北调','六神无主','一诺千金','鬼斧神工','一字千金','九霄云外','一字之师','一字千金','不次之迁','顶天立地','过目成诵','一落千丈','一箭双雕','顶天立地','一本万利','寿比南山','驾轻就熟','万夫莫开','至高无上','起死回生','灵丹妙药','药到病除','暗无天日','一呼百应','赤子之心','盖棺定论','一尘不染','琼楼玉宇','一触即发','不肖子孙','有声有色','不得善终','虎头蛇尾','遗臭万年','凿壁偷光','不毛之地','一本万利','寸草不生','九死一生','八面玲珑','五体投地','唇枪舌剑','山穷水尽','杀鸡取卵','惨淡经营','狼狈为奸','铜墙铁壁','才子佳人','异想天开','画饼充饥','偷梁换柱','铜墙铁壁','拔山举鼎','一发千钧','偷梁换柱','理屈词穷','偷天换日','万无一失','一毛不拔','胆小如鼠','不食之地','冠冕堂皇','分文不值','寸草不生','井底之蛙','虎头蛇尾','甜言蜜语','狼心狗肺','一枕黄粱','钢筋铁骨','神出鬼没','偷梁换柱','终南捷径','一丘之貉','一言难尽','千钧一发','陈词滥调','自投罗网','五体投地','气吞山河','不治之症','不解之缘','众口难调','神出鬼没','无米之炊','海市蜃楼','一针见血','画饼充饥','龙潭虎穴','守口如瓶','回味无穷','老蚌生珠','难以置信','一反常态','无孔不入','精卫填海','沐猴而冠','与虎谋皮','天渊之别','铤而走险','天涯海角','玩火自焚','七窍生烟','捕风捉影','万死不辞','一事无成','螳臂当车','争分夺秒','食言而肥','凤毛麟角','一夫当关','逢人说项','一毛不拔','一孔之见','福星高照','无米之炊','千载一时','千钧一发','一诺千金','天壤之别','一笑千金','天涯比邻','一心一意','凤毛麟角','一锤定音','一刻千金','三心二意','正人君子','讽一劝百','一诺千金','讽一劝百','金玉良言','一挥而就','一言九鼎','一劳永逸','千钧一发','十全十美','一发千钧','博古通今','万马奔腾','无所不知','一言为定','锲而不舍','栋梁之材','未卜先知','天涯海角'];
function chengYuJieLong (startword,chengyu){
    var jg =[],w='';
    return str (startword,chengyu)
    function str (startword,chengyu) {
        for(var i =0; i < chengyu.length; i++){
        w = chengyu[i][0]
        if(startword==w){
                jg.push(chengyu[i]);
                str (chengyu[i][chengyu[i].length-1],chengyu)	
                break
            }
        }
        return jg
    }
}









